Tekla.Structures.Analysis.AnalysisPartAnalysisProperties
The AnalysisPartAnalysisProperties class contains information related to analysis part analysis properties.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties._AnalysisClass
The analysis class of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties._BuiltupMode
The builtup mode of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties._DesignGroup
The design group of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties._PhysicalFreezed
This indicates whether the pysical part has been freezed.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClass
The analysis class of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.BuiltupMode
The builtup mode of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.DesignGroup
The design group of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.PhysicalFreezed
Indicates whether the physical part has been freezed.